{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_8", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_23", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_22", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_24", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_23", "trainable": true, "filters": 48, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_25", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_24", "trainable": true, "filters": 10, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_26", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_8", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "activation": "softmax"}}]}}, "training_config": {"optimizer_config": {"class_name": "Adadelta", "config": {"lr": 1.0, "rho": 0.95, "decay": 0.0, "epsilon": 1e-07}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_23/gamma", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_23/beta", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_23/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_23/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_24/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_24/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_24/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_24/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_25/gamma", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_25/beta", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_25/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_25/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "batch_normalization_26/gamma", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_26/beta", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_26/moving_mean", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_26/moving_variance", "shape": [10], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 1, 8], "dtype": "float32"}, {"name": "separable_conv2d_22/depthwise_kernel", "shape": [3, 3, 8, 1], "dtype": "float32"}, {"name": "separable_conv2d_22/pointwise_kernel", "shape": [1, 1, 8, 32], "dtype": "float32"}, {"name": "separable_conv2d_23/depthwise_kernel", "shape": [4, 4, 32, 1], "dtype": "float32"}, {"name": "separable_conv2d_23/pointwise_kernel", "shape": [1, 1, 32, 48], "dtype": "float32"}, {"name": "separable_conv2d_24/depthwise_kernel", "shape": [4, 4, 48, 1], "dtype": "float32"}, {"name": "separable_conv2d_24/pointwise_kernel", "shape": [1, 1, 48, 10], "dtype": "float32"}, {"name": "separable_conv2d_24/bias", "shape": [10], "dtype": "float32"}]}]}