{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of4", "group1-shard2of4", "group1-shard3of4", "group1-shard4of4"], "weights": [{"name": "Conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "bn_Conv1/gamma", "shape": [32], "dtype": "float32"}, {"name": "bn_Conv1/beta", "shape": [32], "dtype": "float32"}, {"name": "bn_Conv1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "bn_Conv1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "mobl0_conv_0_depthwise/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "bn0_conv_0_bn_depthwise/gamma", "shape": [32], "dtype": "float32"}, {"name": "bn0_conv_0_bn_depthwise/beta", "shape": [32], "dtype": "float32"}, {"name": "bn0_conv_0_bn_depthwise/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "bn0_conv_0_bn_depthwise/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "mobl0_conv_0_project/kernel", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "bn0_conv_0_bn_project/gamma", "shape": [16], "dtype": "float32"}, {"name": "bn0_conv_0_bn_project/beta", "shape": [16], "dtype": "float32"}, {"name": "bn0_conv_0_bn_project/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "bn0_conv_0_bn_project/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "mobl1_conv_1_expand/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "bn1_conv_1_bn_expand/gamma", "shape": [96], "dtype": "float32"}, {"name": "bn1_conv_1_bn_expand/beta", "shape": [96], "dtype": "float32"}, {"name": "bn1_conv_1_bn_expand/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "bn1_conv_1_bn_expand/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "mobl1_conv_1_depthwise/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "bn1_conv_1_bn_depthwise/gamma", "shape": [96], "dtype": "float32"}, {"name": "bn1_conv_1_bn_depthwise/beta", "shape": [96], "dtype": "float32"}, {"name": "bn1_conv_1_bn_depthwise/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "bn1_conv_1_bn_depthwise/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "mobl1_conv_1_project/kernel", "shape": [1, 1, 96, 24], "dtype": "float32"}, {"name": "bn1_conv_1_bn_project/gamma", "shape": [24], "dtype": "float32"}, {"name": "bn1_conv_1_bn_project/beta", "shape": [24], "dtype": "float32"}, {"name": "bn1_conv_1_bn_project/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "bn1_conv_1_bn_project/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "mobl2_conv_2_expand/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "bn2_conv_2_bn_expand/gamma", "shape": [144], "dtype": "float32"}, {"name": "bn2_conv_2_bn_expand/beta", "shape": [144], "dtype": "float32"}, {"name": "bn2_conv_2_bn_expand/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "bn2_conv_2_bn_expand/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "mobl2_conv_2_depthwise/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "bn2_conv_2_bn_depthwise/gamma", "shape": [144], "dtype": "float32"}, {"name": "bn2_conv_2_bn_depthwise/beta", "shape": [144], "dtype": "float32"}, {"name": "bn2_conv_2_bn_depthwise/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "bn2_conv_2_bn_depthwise/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "mobl2_conv_2_project/kernel", "shape": [1, 1, 144, 24], "dtype": "float32"}, {"name": "bn2_conv_2_bn_project/gamma", "shape": [24], "dtype": "float32"}, {"name": "bn2_conv_2_bn_project/beta", "shape": [24], "dtype": "float32"}, {"name": "bn2_conv_2_bn_project/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "bn2_conv_2_bn_project/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "mobl3_conv_3_expand/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "bn3_conv_3_bn_expand/gamma", "shape": [144], "dtype": "float32"}, {"name": "bn3_conv_3_bn_expand/beta", "shape": [144], "dtype": "float32"}, {"name": "bn3_conv_3_bn_expand/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "bn3_conv_3_bn_expand/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "mobl3_conv_3_depthwise/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "bn3_conv_3_bn_depthwise/gamma", "shape": [144], "dtype": "float32"}, {"name": "bn3_conv_3_bn_depthwise/beta", "shape": [144], "dtype": "float32"}, {"name": "bn3_conv_3_bn_depthwise/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "bn3_conv_3_bn_depthwise/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "mobl3_conv_3_project/kernel", "shape": [1, 1, 144, 32], "dtype": "float32"}, {"name": "bn3_conv_3_bn_project/gamma", "shape": [32], "dtype": "float32"}, {"name": "bn3_conv_3_bn_project/beta", "shape": [32], "dtype": "float32"}, {"name": "bn3_conv_3_bn_project/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "bn3_conv_3_bn_project/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "mobl4_conv_4_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "bn4_conv_4_bn_expand/gamma", "shape": [192], "dtype": "float32"}, {"name": "bn4_conv_4_bn_expand/beta", "shape": [192], "dtype": "float32"}, {"name": "bn4_conv_4_bn_expand/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "bn4_conv_4_bn_expand/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "mobl4_conv_4_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "bn4_conv_4_bn_depthwise/gamma", "shape": [192], "dtype": "float32"}, {"name": "bn4_conv_4_bn_depthwise/beta", "shape": [192], "dtype": "float32"}, {"name": "bn4_conv_4_bn_depthwise/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "bn4_conv_4_bn_depthwise/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "mobl4_conv_4_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "bn4_conv_4_bn_project/gamma", "shape": [32], "dtype": "float32"}, {"name": "bn4_conv_4_bn_project/beta", "shape": [32], "dtype": "float32"}, {"name": "bn4_conv_4_bn_project/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "bn4_conv_4_bn_project/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "mobl5_conv_5_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "bn5_conv_5_bn_expand/gamma", "shape": [192], "dtype": "float32"}, {"name": "bn5_conv_5_bn_expand/beta", "shape": [192], "dtype": "float32"}, {"name": "bn5_conv_5_bn_expand/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "bn5_conv_5_bn_expand/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "mobl5_conv_5_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "bn5_conv_5_bn_depthwise/gamma", "shape": [192], "dtype": "float32"}, {"name": "bn5_conv_5_bn_depthwise/beta", "shape": [192], "dtype": "float32"}, {"name": "bn5_conv_5_bn_depthwise/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "bn5_conv_5_bn_depthwise/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "mobl5_conv_5_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "bn5_conv_5_bn_project/gamma", "shape": [32], "dtype": "float32"}, {"name": "bn5_conv_5_bn_project/beta", "shape": [32], "dtype": "float32"}, {"name": "bn5_conv_5_bn_project/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "bn5_conv_5_bn_project/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "mobl6_conv_6_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "bn6_conv_6_bn_expand/gamma", "shape": [192], "dtype": "float32"}, {"name": "bn6_conv_6_bn_expand/beta", "shape": [192], "dtype": "float32"}, {"name": "bn6_conv_6_bn_expand/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "bn6_conv_6_bn_expand/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "mobl6_conv_6_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "bn6_conv_6_bn_depthwise/gamma", "shape": [192], "dtype": "float32"}, {"name": "bn6_conv_6_bn_depthwise/beta", "shape": [192], "dtype": "float32"}, {"name": "bn6_conv_6_bn_depthwise/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "bn6_conv_6_bn_depthwise/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "mobl6_conv_6_project/kernel", "shape": [1, 1, 192, 64], "dtype": "float32"}, {"name": "bn6_conv_6_bn_project/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn6_conv_6_bn_project/beta", "shape": [64], "dtype": "float32"}, {"name": "bn6_conv_6_bn_project/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn6_conv_6_bn_project/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "mobl7_conv_7_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"}, {"name": "bn7_conv_7_bn_expand/gamma", "shape": [384], "dtype": "float32"}, {"name": "bn7_conv_7_bn_expand/beta", "shape": [384], "dtype": "float32"}, {"name": "bn7_conv_7_bn_expand/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "bn7_conv_7_bn_expand/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "mobl7_conv_7_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "bn7_conv_7_bn_depthwise/gamma", "shape": [384], "dtype": "float32"}, {"name": "bn7_conv_7_bn_depthwise/beta", "shape": [384], "dtype": "float32"}, {"name": "bn7_conv_7_bn_depthwise/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "bn7_conv_7_bn_depthwise/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "mobl7_conv_7_project/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"}, {"name": "bn7_conv_7_bn_project/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn7_conv_7_bn_project/beta", "shape": [64], "dtype": "float32"}, {"name": "bn7_conv_7_bn_project/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn7_conv_7_bn_project/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "mobl8_conv_8_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"}, {"name": "bn8_conv_8_bn_expand/gamma", "shape": [384], "dtype": "float32"}, {"name": "bn8_conv_8_bn_expand/beta", "shape": [384], "dtype": "float32"}, {"name": "bn8_conv_8_bn_expand/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "bn8_conv_8_bn_expand/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "mobl8_conv_8_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "bn8_conv_8_bn_depthwise/gamma", "shape": [384], "dtype": "float32"}, {"name": "bn8_conv_8_bn_depthwise/beta", "shape": [384], "dtype": "float32"}, {"name": "bn8_conv_8_bn_depthwise/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "bn8_conv_8_bn_depthwise/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "mobl8_conv_8_project/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"}, {"name": "bn8_conv_8_bn_project/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn8_conv_8_bn_project/beta", "shape": [64], "dtype": "float32"}, {"name": "bn8_conv_8_bn_project/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn8_conv_8_bn_project/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "mobl9_conv_9_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"}, {"name": "bn9_conv_9_bn_expand/gamma", "shape": [384], "dtype": "float32"}, {"name": "bn9_conv_9_bn_expand/beta", "shape": [384], "dtype": "float32"}, {"name": "bn9_conv_9_bn_expand/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "bn9_conv_9_bn_expand/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "mobl9_conv_9_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "bn9_conv_9_bn_depthwise/gamma", "shape": [384], "dtype": "float32"}, {"name": "bn9_conv_9_bn_depthwise/beta", "shape": [384], "dtype": "float32"}, {"name": "bn9_conv_9_bn_depthwise/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "bn9_conv_9_bn_depthwise/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "mobl9_conv_9_project/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"}, {"name": "bn9_conv_9_bn_project/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn9_conv_9_bn_project/beta", "shape": [64], "dtype": "float32"}, {"name": "bn9_conv_9_bn_project/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn9_conv_9_bn_project/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "mobl10_conv_10_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"}, {"name": "bn10_conv_10_bn_expand/gamma", "shape": [384], "dtype": "float32"}, {"name": "bn10_conv_10_bn_expand/beta", "shape": [384], "dtype": "float32"}, {"name": "bn10_conv_10_bn_expand/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "bn10_conv_10_bn_expand/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "mobl10_conv_10_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "bn10_conv_10_bn_depthwise/gamma", "shape": [384], "dtype": "float32"}, {"name": "bn10_conv_10_bn_depthwise/beta", "shape": [384], "dtype": "float32"}, {"name": "bn10_conv_10_bn_depthwise/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "bn10_conv_10_bn_depthwise/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "mobl10_conv_10_project/kernel", "shape": [1, 1, 384, 96], "dtype": "float32"}, {"name": "bn10_conv_10_bn_project/gamma", "shape": [96], "dtype": "float32"}, {"name": "bn10_conv_10_bn_project/beta", "shape": [96], "dtype": "float32"}, {"name": "bn10_conv_10_bn_project/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "bn10_conv_10_bn_project/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "mobl11_conv_11_expand/kernel", "shape": [1, 1, 96, 576], "dtype": "float32"}, {"name": "bn11_conv_11_bn_expand/gamma", "shape": [576], "dtype": "float32"}, {"name": "bn11_conv_11_bn_expand/beta", "shape": [576], "dtype": "float32"}, {"name": "bn11_conv_11_bn_expand/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "bn11_conv_11_bn_expand/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "mobl11_conv_11_depthwise/depthwise_kernel", "shape": [3, 3, 576, 1], "dtype": "float32"}, {"name": "bn11_conv_11_bn_depthwise/gamma", "shape": [576], "dtype": "float32"}, {"name": "bn11_conv_11_bn_depthwise/beta", "shape": [576], "dtype": "float32"}, {"name": "bn11_conv_11_bn_depthwise/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "bn11_conv_11_bn_depthwise/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "mobl11_conv_11_project/kernel", "shape": [1, 1, 576, 96], "dtype": "float32"}, {"name": "bn11_conv_11_bn_project/gamma", "shape": [96], "dtype": "float32"}, {"name": "bn11_conv_11_bn_project/beta", "shape": [96], "dtype": "float32"}, {"name": "bn11_conv_11_bn_project/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "bn11_conv_11_bn_project/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "mobl12_conv_12_expand/kernel", "shape": [1, 1, 96, 576], "dtype": "float32"}, {"name": "bn12_conv_12_bn_expand/gamma", "shape": [576], "dtype": "float32"}, {"name": "bn12_conv_12_bn_expand/beta", "shape": [576], "dtype": "float32"}, {"name": "bn12_conv_12_bn_expand/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "bn12_conv_12_bn_expand/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "mobl12_conv_12_depthwise/depthwise_kernel", "shape": [3, 3, 576, 1], "dtype": "float32"}, {"name": "bn12_conv_12_bn_depthwise/gamma", "shape": [576], "dtype": "float32"}, {"name": "bn12_conv_12_bn_depthwise/beta", "shape": [576], "dtype": "float32"}, {"name": "bn12_conv_12_bn_depthwise/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "bn12_conv_12_bn_depthwise/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "mobl12_conv_12_project/kernel", "shape": [1, 1, 576, 96], "dtype": "float32"}, {"name": "bn12_conv_12_bn_project/gamma", "shape": [96], "dtype": "float32"}, {"name": "bn12_conv_12_bn_project/beta", "shape": [96], "dtype": "float32"}, {"name": "bn12_conv_12_bn_project/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "bn12_conv_12_bn_project/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "mobl13_conv_13_expand/kernel", "shape": [1, 1, 96, 576], "dtype": "float32"}, {"name": "bn13_conv_13_bn_expand/gamma", "shape": [576], "dtype": "float32"}, {"name": "bn13_conv_13_bn_expand/beta", "shape": [576], "dtype": "float32"}, {"name": "bn13_conv_13_bn_expand/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "bn13_conv_13_bn_expand/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "mobl13_conv_13_depthwise/depthwise_kernel", "shape": [3, 3, 576, 1], "dtype": "float32"}, {"name": "bn13_conv_13_bn_depthwise/gamma", "shape": [576], "dtype": "float32"}, {"name": "bn13_conv_13_bn_depthwise/beta", "shape": [576], "dtype": "float32"}, {"name": "bn13_conv_13_bn_depthwise/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "bn13_conv_13_bn_depthwise/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "mobl13_conv_13_project/kernel", "shape": [1, 1, 576, 160], "dtype": "float32"}, {"name": "bn13_conv_13_bn_project/gamma", "shape": [160], "dtype": "float32"}, {"name": "bn13_conv_13_bn_project/beta", "shape": [160], "dtype": "float32"}, {"name": "bn13_conv_13_bn_project/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "bn13_conv_13_bn_project/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "mobl14_conv_14_expand/kernel", "shape": [1, 1, 160, 960], "dtype": "float32"}, {"name": "bn14_conv_14_bn_expand/gamma", "shape": [960], "dtype": "float32"}, {"name": "bn14_conv_14_bn_expand/beta", "shape": [960], "dtype": "float32"}, {"name": "bn14_conv_14_bn_expand/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "bn14_conv_14_bn_expand/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "mobl14_conv_14_depthwise/depthwise_kernel", "shape": [3, 3, 960, 1], "dtype": "float32"}, {"name": "bn14_conv_14_bn_depthwise/gamma", "shape": [960], "dtype": "float32"}, {"name": "bn14_conv_14_bn_depthwise/beta", "shape": [960], "dtype": "float32"}, {"name": "bn14_conv_14_bn_depthwise/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "bn14_conv_14_bn_depthwise/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "mobl14_conv_14_project/kernel", "shape": [1, 1, 960, 160], "dtype": "float32"}, {"name": "bn14_conv_14_bn_project/gamma", "shape": [160], "dtype": "float32"}, {"name": "bn14_conv_14_bn_project/beta", "shape": [160], "dtype": "float32"}, {"name": "bn14_conv_14_bn_project/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "bn14_conv_14_bn_project/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "mobl15_conv_15_expand/kernel", "shape": [1, 1, 160, 960], "dtype": "float32"}, {"name": "bn15_conv_15_bn_expand/gamma", "shape": [960], "dtype": "float32"}, {"name": "bn15_conv_15_bn_expand/beta", "shape": [960], "dtype": "float32"}, {"name": "bn15_conv_15_bn_expand/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "bn15_conv_15_bn_expand/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "mobl15_conv_15_depthwise/depthwise_kernel", "shape": [3, 3, 960, 1], "dtype": "float32"}, {"name": "bn15_conv_15_bn_depthwise/gamma", "shape": [960], "dtype": "float32"}, {"name": "bn15_conv_15_bn_depthwise/beta", "shape": [960], "dtype": "float32"}, {"name": "bn15_conv_15_bn_depthwise/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "bn15_conv_15_bn_depthwise/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "mobl15_conv_15_project/kernel", "shape": [1, 1, 960, 160], "dtype": "float32"}, {"name": "bn15_conv_15_bn_project/gamma", "shape": [160], "dtype": "float32"}, {"name": "bn15_conv_15_bn_project/beta", "shape": [160], "dtype": "float32"}, {"name": "bn15_conv_15_bn_project/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "bn15_conv_15_bn_project/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "mobl16_conv_16_expand/kernel", "shape": [1, 1, 160, 960], "dtype": "float32"}, {"name": "bn16_conv_16_bn_expand/gamma", "shape": [960], "dtype": "float32"}, {"name": "bn16_conv_16_bn_expand/beta", "shape": [960], "dtype": "float32"}, {"name": "bn16_conv_16_bn_expand/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "bn16_conv_16_bn_expand/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "mobl16_conv_16_depthwise/depthwise_kernel", "shape": [3, 3, 960, 1], "dtype": "float32"}, {"name": "bn16_conv_16_bn_depthwise/gamma", "shape": [960], "dtype": "float32"}, {"name": "bn16_conv_16_bn_depthwise/beta", "shape": [960], "dtype": "float32"}, {"name": "bn16_conv_16_bn_depthwise/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "bn16_conv_16_bn_depthwise/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "mobl16_conv_16_project/kernel", "shape": [1, 1, 960, 320], "dtype": "float32"}, {"name": "bn16_conv_16_bn_project/gamma", "shape": [320], "dtype": "float32"}, {"name": "bn16_conv_16_bn_project/beta", "shape": [320], "dtype": "float32"}, {"name": "bn16_conv_16_bn_project/moving_mean", "shape": [320], "dtype": "float32"}, {"name": "bn16_conv_16_bn_project/moving_variance", "shape": [320], "dtype": "float32"}, {"name": "Conv_1/kernel", "shape": [1, 1, 320, 1280], "dtype": "float32"}, {"name": "Conv_1_bn/gamma", "shape": [1280], "dtype": "float32"}, {"name": "Conv_1_bn/beta", "shape": [1280], "dtype": "float32"}, {"name": "Conv_1_bn/moving_mean", "shape": [1280], "dtype": "float32"}, {"name": "Conv_1_bn/moving_variance", "shape": [1280], "dtype": "float32"}, {"name": "Logits/kernel", "shape": [1280, 1000], "dtype": "float32"}, {"name": "Logits/bias", "shape": [1000], "dtype": "float32"}]}]}